
$(document).ready(function(){
	init();
	ClickNext();
});
{	
	var JsonBlock={
		Block1:[
			{
				title: "1、您参与金融投资的时间是：",			
				content:["1年及以下","1-5年","5-10年","10-15年","15年及以上"]
			},
			{
				title: "2、您的年龄处于以下数值区间是：",			
				content:["20岁-30岁","30岁-40岁","40-50岁","50岁以上"]
			},
			{
				title: "3、您的学历是：",			
				content:["初中或初中以下","高中（中专）","本科、大专","硕士研究生","博士研究生以上"]
			},
			{
				title: "4、您的职业与金融行业相关程度：",			
				content:["从事金融行业","关系比较紧密","有一定相关","完全不相关"]
			},
			{
				title: "5、您是否参加过投资相关培训：",			
				content:["是","否"]
			},
			{
				title: "6、您目前的家庭年可支配收入为：",			
				content:["5万以下","5万-10万","10万-20万","20万-50万","50万-100万","100万以上"]
			},
			{
				title: "7、您最近3个月的金融投资收益如何？",			
				content:["亏损8%以上","亏损3%以上、8%以下","亏损或盈利在3%以内","盈利在3%以上、8%以内","盈利在8%以上"]	
			},
			{
				title: "8、您最近一年的金融投资收益如何？",			
				content:["亏损20%以上","亏损5%以内、20%以内","亏损或盈利在3%以内","亏损或盈利在5%以内","盈利5%以上、20%以内",
				         "盈利20%以上"]	     
			},
			{
				title: "9、您进行投资的资金来源主要是：",			
				content:["自有资金","他人委托","借款或贷款（年利率3%以下）","借款或贷款（年利率3%-7%）","借款或贷款（年利率7%以上）"]	
			},
			{
				title: "10、您面临的现金流压力如何？",			
				content:["现金流长期充裕，几乎没有压力","现金流短期没压力、长期压力较小","现金流长期有一定压力，需要一定的投资收益补充现金流",
				"现金流短期有一定压力，需要流动性较强资产","现金流压力较大，随时需要将投资转化为现金"]		
			},
			{
				title: "11、您投资的预期年收益为：",			
				content:["4%以下","4%-7%","7%-12%","12%-20%","20%-30%","30%以上"]	
			},
			{
				title: "12、您投资的预期时间长度为：",			
				content:["3个月以下","3个月到6个月","6个月到1年","1年到2年","2年到5年","5年到10年","10年以上"]	
			},
			{
				title: "13、您预期进行投资的规模为：",			
				content:["50万以下","50万-500万","500万-1000万","100万-5000万","5000万以上"]	
			},
			{
				title: "14、您可以将多少比例的投资收益用于再投资：",			
				content:["所有投资收益","50%以上的投资收益","20%-50%的投资收益","20%以下的投资收益","所有投资收益都不做再投资"]		
			},
			{
				title: "15、您每年将您家庭总收入的百分之多少进行金融投资：",			
				content:["10%或以下","11%-25%","26%-40%","40%-55%","55%以上"]	
			},
			{   pid:16,
				/*title: "16、您最关注投资产标的哪些属性？（1分为不关注，5分为非常关注）：",			
				content:["风险性：   1   2   3   4   5","收益性：   1   2   3   4   5",
				        "流通性：   1   2   3   4   5","安全性：   1   2   3   4   5"]	*/
			},
			{
				title: "17、您的风险承受能力为：",			
				content:["不低于预期收益","不低于同期银行一年期存款利率","本金不亏损","本金亏损不超过10%",
				         "本金亏损不超过20%","本金亏损20%以上"]		
			},
			{
				title: "18、您是否会进行融资投资：",			
				content:["经常进行融资投资","当有较大的几率盈利时会进行融资投资","当几乎确定会盈利时会进行融资投资",
				         "无论如何都不会进行融资投资"]	
			},
			{
				title: "19、您接收新鲜事物的程度：",			
				content:["经常尝试新鲜事物","偶尔尝试新鲜事物","接受新鲜事物比较慢"]	
			},
			{
				title: "20、综合收益和风险，您最愿意将资金投资到下面哪个方向：",			
				content:["非保本结构性产品（与货币、商船、利率等挂钩）","股票、股票型基金","股票与债券混合型产品",
	                     "债券、债券基金、货币市场基金","国债或存款","股指期货、期权","其他（请注明）"]	
			},
			{
				title: "21、您更喜欢哪种类型的交易策略：",			
				content:["完全对冲套利型","有较小的风险敞口型","完全无对冲保护性"]

			},
			{
				title: "22、您能够接受有杠杆的交易？",			
				content:["不能接受有杠杆的交易","可以接受有2倍以下杠杆的交易","可以接受有2-5倍杠杆的交易",
	                     "可以接受有2-10倍杠杆的交易","可以接受有10倍杠杆以上的交易"]	
			},
			{
				title: "23、您能否接受投资新的交易品种？",			
				content:["完全可以接受投资新的交易品种","无所谓是否投资新的交易品种","完全不能接受投资新的交易品种"]	
			},
			{
				title: "24、您认为比较理想的可以考察投资绩效的时间段是多长？",			
				content:["10年以上","5年至10年","3年至5年","1至3年","1年以下"]	
			},
			{
				title: "25、如果运用新策略进行投资，您更倾向于选择下列哪种：",			
				content:["有获得30%以上收益的可能，但也有损失30%本金的可能","投资本金可接受一定范围内波动，但预期收益在10%以内",
	                     "投资本金基本能得到保障，回报高于定期存款即可","不希望投资本金承担风险，接受的回报大约与定期存款一样"]	
			},
			{
				title: "26、出现亏损您一般如何操作选择：",			
				content:["交易前设好止损并能够执行止损操作","虽然没有设好止损但实际操作中能够在一定范围内执行止损",
						 "开始不止损，并补仓摊低成本，跌到自己难以承受时再止损","不止损，继续持有等待解套"]	
			},
			{
				title: "27、您在使用新策略的开始，是否接受先半人工的模拟策略，然后再实现计算机自动交易？",			
				content:["是","否"]	
			},
			{
				title: "28、在使用新的策略/交易方法进入市场交易时，您可以用于交易的资金量是多少？",			
				content:["100万及以下","101万-500万","501万-1000万","1001万-5000万","5000万以上"]	
			},
			
		],
		Block2:[{
				title: "29、您曾参与过的金融市场有（可多选）：",			
				content:["沪深股票市场","香港股票市场","新三板市场","国际股票市场","债券市场","外汇市场","股指期货市场",
				"期权市场","基金市场","其他（请注明）"]
			},
			{
				title: "30、您希望参与的金融市场有（可多选）：",			
				content:["沪深股票市场","香港股票市场","新三板市场","国际股票市场","债券市场","外汇市场",
				         "股指期货市场","期权市场","基金市场","其他（请注明）"]		
			},
			{
				title: "31、您不希望进入的金融市场有（可多选）：",			
				content:["沪深股票市场","香港股票市场","新三板市场","国际股票市场","债券市场","外汇市场",
				         "股指期货市场","期权市场","基金市场","其他（请注明）"]	
			},
			{
				title: "32、您投资的操作方法为（可多选）：",			
				content:["自己操作","委托非机构的他人操作","委托专业机构进行操作"]	
			},
			{
				title: "33、您是否进行过量化交易？量化交易进行的市场有（可多选）：",			
				content:["未进行过量化交易","沪深股票市场","香港股票市场","新三板股票市场","国际股票市场",
					     "债券市场","外汇市场","股指期货","期权市场","基金市场"]	
			},
			{
				title: "34、您是否进行过计算机交易？计算机交易进行的市场有（可多选）：",			
				content:["未进行过量化交易","沪深股票市场","香港股票市场","新三板股票市场","国际股票市场",
					     "债券市场","外汇市场","股指期货","期权市场","基金市场"]	
			},
			{
				title: "35、您是否拥有以下资格认证中的一项或几项（可多选）：",			
				content:["注册金融策划师（CFP）","注册金融分析师（CFA）","金融风险管理师（FRM）","香港注册金融风险管理师（CFRM）",
						  "保险精算师（FIA）","国际注册会计师资格（ACCA）","注册会计师（CPA）","注册国际投资分析师（CIIA）","没有进行以上资格认证"]
			}]
	}
}

//替换
function init(){
		disPlayPersonItem(0,6);
}

var nowPage=0;
//显示问题列表
function disPlayPersonItem(start,end){
	var title;
	var content;
		for(var i=start;i<end;i++){
			
			if(i<15){
				title=JsonBlock.Block1[i].title;
				content=JsonBlock.Block1[i].content;
				initItem1(title,content);
			}else if(i==15){
				title=JsonBlock.Block1[i].title;
				content=JsonBlock.Block1[i].content;
				initItem16();
			}else if(i<28){
				title=JsonBlock.Block1[i].title;
				content=JsonBlock.Block1[i].content;
				initItem1(title,content);
			}else{
				title=JsonBlock.Block2[i-28].title;
				content=JsonBlock.Block2[i-28].content;
				initItem2(title,content);
			}
		}
}

function ClickNext(){
	 $("#next").bind("click",function(){
		
		 $("#next").bind("click",function(){
	
		 if(nowPage < 6){
			$("div").remove(".testBlock");
		 }
		 
		 if(nowPage==0){
			 disPlayPersonItem(6,11);
		 }else if(nowPage==1){
			 disPlayPersonItem(11,16);
		 }else if(nowPage==2){
			 disPlayPersonItem(16,22);
		 }else if(nowPage==3){
			 disPlayPersonItem(22,28);
		 }else if(nowPage==4){
			 disPlayPersonItem(28,31);
		 }else if(nowPage==5){
			 disPlayPersonItem(31,35);
			 login();
		 }else{
			 $("#next").css("display","none").css("disabled","true");
		 }	 
		 nowPage++;
		 });
	 });
}


function login(){
	var input1=document.createElement('input');
	$(input1).attr({"type":"button","value":"提交"});
	$(input1).addClass('mbtn1');
	document.getElementsByTagName('body')[0].appendChild(input1);
}



